Connecting with database

In [62]:
#!pip install pyodbc 

import pandas as pd
import pyodbc 

server = 'DESKTOP-505F0PE'
database = 'Python'
conexaoDB = pyodbc.connect('DRIVER={ODBC Driver 17 for SQL Server};'
                      f'SERVER={server};'
                      f'DATABASE={database};'
                      'Trusted_Connection=yes;')

cursor = conexaoDB.cursor()

In [63]:
dados = pd.read_excel(r"D:\engenharia de dados\curso udemy\Arquivos\04.+ETL+Pandas\04. ETL Pandas\arquivos_excel\Produto.xlsx")
dados = dados.drop_duplicates()
dados.head(5)

   ID                  Name  Price  Id_Category
0   0       Sapato vermelho     96            0
2   1  Bolsa mais que Velha   8000            0
3   2                 Calça     75            0
4   3    Camisa apertadinha    170            0
5   4   Vestido Super curto     57            0

In [64]:
dados.columns

Index(['ID', 'Name', 'Price', 'Id_Category'], dtype='object')

In [65]:
str(dados.columns).replace("'","")

'Index([ID, Name, Price, Id_Category], dtype=object)'

Insert dataframe into sqlserver

In [66]:
dados.head(5)

   ID                  Name  Price  Id_Category
0   0       Sapato vermelho     96            0
2   1  Bolsa mais que Velha   8000            0
3   2                 Calça     75            0
4   3    Camisa apertadinha    170            0
5   4   Vestido Super curto     57            0

In [67]:
cursor.execute('delete  from [Produtos]')   
cursor.commit()

In [68]:
for index, linha in dados.iterrows():
    
    cursor.execute("Insert into [Produtos](ID,Nome,Price,Id_Category)values(?,?,?,?)",linha.ID,linha.Name,linha.Price,linha.Id_Category) 
cursor.commit() 
cursor.close()   
conexaoDB.close()